applications/solvers/incompressible/simpleFoam_MG/pitzDaily/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//DebugSwitches
//{
//    fileMonitor 1;
//}

application     simpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         20;

deltaT          1;

writeControl    timeStep;

writeInterval   1;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

//functions
//{
////    #includeFunc streamlines
//    fileUpdate1
//    {
//        type              timeActivatedFileUpdate;
//        libs              ("libutilityFunctionObjects.so");
////        writeControl      timeStep;
////        writeInterval     1;
//        fileToUpdate      "$FOAM_CASE/system/fvSolution";
//        timeVsFile
//        (
//            (-1 "$FOAM_CASE/system/fvSolution.0")
//            (10 "$FOAM_CASE/system/fvSolution.10")
//        );
//    }
//}

// ************************************************************************* //
